espressif/esp-idf/components/soc/esp32c5/register/soc/lp_aon_reg.h
/** LP_AON_DEBUG_SEL0_REG register
 *  reserved
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define LP_AON_DEBUG_SEL0_REG (DR_REG_LP_AON_BASE + 0x68)
/** LP_AON_LP_DEBUG_SEL0 : R/W; bitpos: [6:0]; default: 0;
 *  need des
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define LP_AON_LP_DEBUG_SEL0    0x0000007FU
#define LP_AON_LP_DEBUG_SEL0_M  (LP_AON_LP_DEBUG_SEL0_V << LP_AON_LP_DEBUG_SEL0_S)
#define LP_AON_LP_DEBUG_SEL0_V  0x0000007FU
#define LP_AON_LP_DEBUG_SEL0_S  0
/** LP_AON_LP_DEBUG_SEL1 : R/W; bitpos: [13:7]; default: 0;
 *  need des
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define LP_AON_LP_DEBUG_SEL1    0x0000007FU
#define LP_AON_LP_DEBUG_SEL1_M  (LP_AON_LP_DEBUG_SEL1_V << LP_AON_LP_DEBUG_SEL1_S)
#define LP_AON_LP_DEBUG_SEL1_V  0x0000007FU
#define LP_AON_LP_DEBUG_SEL1_S  7
/** LP_AON_LP_DEBUG_SEL2 : R/W; bitpos: [20:14]; default: 0;
 *  need des
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define LP_AON_LP_DEBUG_SEL2    0x0000007FU
#define LP_AON_LP_DEBUG_SEL2_M  (LP_AON_LP_DEBUG_SEL2_V << LP_AON_LP_DEBUG_SEL2_S)
#define LP_AON_LP_DEBUG_SEL2_V  0x0000007FU
#define LP_AON_LP_DEBUG_SEL2_S  14
/** LP_AON_LP_DEBUG_SEL3 : R/W; bitpos: [27:21]; default: 0;
 *  need des
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define LP_AON_LP_DEBUG_SEL3    0x0000007FU
#define LP_AON_LP_DEBUG_SEL3_M  (LP_AON_LP_DEBUG_SEL3_V << LP_AON_LP_DEBUG_SEL3_S)
#define LP_AON_LP_DEBUG_SEL3_V  0x0000007FU
#define LP_AON_LP_DEBUG_SEL3_S  21

/** LP_AON_DEBUG_SEL1_REG register
 *  need des
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define LP_AON_DEBUG_SEL1_REG (DR_REG_LP_AON_BASE + 0x6c)
/** LP_AON_LP_DEBUG_SEL4 : R/W; bitpos: [6:0]; default: 0;
 *  need des
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define LP_AON_LP_DEBUG_SEL4    0x0000007FU
#define LP_AON_LP_DEBUG_SEL4_M  (LP_AON_LP_DEBUG_SEL4_V << LP_AON_LP_DEBUG_SEL4_S)
#define LP_AON_LP_DEBUG_SEL4_V  0x0000007FU
#define LP_AON_LP_DEBUG_SEL4_S  0

/** LP_AON_BACKUP_DMA_CFG0_REG register
 *  configure regdma always on register
 */
#define LP_AON_BACKUP_DMA_CFG0_REG (DR_REG_LP_AON_BASE + 0x70)
/** LP_AON_BURST_LIMIT_AON : R/W; bitpos: [4:0]; default: 10;
 *  Set this field to configure max value of burst in single transfer.
 */
#define LP_AON_BURST_LIMIT_AON    0x0000001FU
#define LP_AON_BURST_LIMIT_AON_M  (LP_AON_BURST_LIMIT_AON_V << LP_AON_BURST_LIMIT_AON_S)
#define LP_AON_BURST_LIMIT_AON_V  0x0000001FU
#define LP_AON_BURST_LIMIT_AON_S  0
/** LP_AON_READ_INTERVAL_AON : R/W; bitpos: [11:5]; default: 10;
 *  Set this field to configure read registers' interval time in reading mode.
 */
#define LP_AON_READ_INTERVAL_AON    0x0000007FU
#define LP_AON_READ_INTERVAL_AON_M  (LP_AON_READ_INTERVAL_AON_V << LP_AON_READ_INTERVAL_AON_S)
#define LP_AON_READ_INTERVAL_AON_V  0x0000007FU
#define LP_AON_READ_INTERVAL_AON_S  5
/** LP_AON_BRANCH_LINK_LENGTH_AON : R/W; bitpos: [15:12]; default: 0;
 *  Set this field to configure link address.
 */
#define LP_AON_BRANCH_LINK_LENGTH_AON    0x0000000FU
#define LP_AON_BRANCH_LINK_LENGTH_AON_M  (LP_AON_BRANCH_LINK_LENGTH_AON_V << LP_AON_BRANCH_LINK_LENGTH_AON_S)
#define LP_AON_BRANCH_LINK_LENGTH_AON_V  0x0000000FU
#define LP_AON_BRANCH_LINK_LENGTH_AON_S  12

/** LP_AON_BACKUP_DMA_CFG1_REG register
 *  configure regdma always on register
 */
#define LP_AON_BACKUP_DMA_CFG1_REG (DR_REG_LP_AON_BASE + 0x74)
/** LP_AON_LINK_WAIT_TOUT_THRES_AON : R/W; bitpos: [9:0]; default: 100;
 *  Set this field to configure the number of consecutive links of link list.
 */
#define LP_AON_LINK_WAIT_TOUT_THRES_AON    0x000003FFU
#define LP_AON_LINK_WAIT_TOUT_THRES_AON_M  (LP_AON_LINK_WAIT_TOUT_THRES_AON_V << LP_AON_LINK_WAIT_TOUT_THRES_AON_S)
#define LP_AON_LINK_WAIT_TOUT_THRES_AON_V  0x000003FFU
#define LP_AON_LINK_WAIT_TOUT_THRES_AON_S  0
/** LP_AON_LINK_WORK_TOUT_THRES_AON : R/W; bitpos: [19:10]; default: 100;
 *  Set this field to configure maximum waiting time in waiting mode.
 */
#define LP_AON_LINK_WORK_TOUT_THRES_AON    0x000003FFU
#define LP_AON_LINK_WORK_TOUT_THRES_AON_M  (LP_AON_LINK_WORK_TOUT_THRES_AON_V << LP_AON_LINK_WORK_TOUT_THRES_AON_S)
#define LP_AON_LINK_WORK_TOUT_THRES_AON_V  0x000003FFU
#define LP_AON_LINK_WORK_TOUT_THRES_AON_S  10
/** LP_AON_LINK_BACKUP_TOUT_THRES_AON : R/W; bitpos: [29:20]; default: 100;
 *  Set this field to configure maximum waiting time in backup mode.
 */
#define LP_AON_LINK_BACKUP_TOUT_THRES_AON    0x000003FFU
#define LP_AON_LINK_BACKUP_TOUT_THRES_AON_M  (LP_AON_LINK_BACKUP_TOUT_THRES_AON_V << LP_AON_LINK_BACKUP_TOUT_THRES_AON_S)
#define LP_AON_LINK_BACKUP_TOUT_THRES_AON_V  0x000003FFU
#define LP_AON_LINK_BACKUP_TOUT_THRES_AON_S  20
/** LP_AON_AON_BYPASS : R/W; bitpos: [31]; default: 0;
 *  reserved
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define LP_AON_AON_BYPASS    (BIT(31))
#define LP_AON_AON_BYPASS_M  (LP_AON_AON_BYPASS_V << LP_AON_AON_BYPASS_S)
#define LP_AON_AON_BYPASS_V  0x00000001U
#define LP_AON_AON_BYPASS_S  31

/** LP_AON_BACKUP_DMA_CFG2_REG register
 *  configure regdma always on register
 */
#define LP_AON_BACKUP_DMA_CFG2_REG (DR_REG_LP_AON_BASE + 0x78)
/** LP_AON_LINK_ADDR_AON : R/W; bitpos: [31:0]; default: 0;
 *  Set this field to configure link address.
 */
#define LP_AON_LINK_ADDR_AON    0xFFFFFFFFU
#define LP_AON_LINK_ADDR_AON_M  (LP_AON_LINK_ADDR_AON_V << LP_AON_LINK_ADDR_AON_S)
#define LP_AON_LINK_ADDR_AON_V  0xFFFFFFFFU
#define LP_AON_LINK_ADDR_AON_S  0

/** LP_AON_MEM_CTRL_REG register
 *  configure rmemory power in lp system register
 */
#define LP_AON_MEM_CTRL_REG (DR_REG_LP_AON_BASE + 0x7c)
/** LP_AON_LP_MEM_FORCE_PD : R/W; bitpos: [0]; default: 0;
 *  force off lp memory
 */
#define LP_AON_LP_MEM_FORCE_PD    (BIT(0))
#define LP_AON_LP_MEM_FORCE_PD_M  (LP_AON_LP_MEM_FORCE_PD_V << LP_AON_LP_MEM_FORCE_PD_S)
#define LP_AON_LP_MEM_FORCE_PD_V  0x00000001U
#define LP_AON_LP_MEM_FORCE_PD_S  0
/** LP_AON_LP_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  force on lp memory
 */
#define LP_AON_LP_MEM_FORCE_PU    (BIT(1))
#define LP_AON_LP_MEM_FORCE_PU_M  (LP_AON_LP_MEM_FORCE_PU_V << LP_AON_LP_MEM_FORCE_PU_S)
#define LP_AON_LP_MEM_FORCE_PU_V  0x00000001U
#define LP_AON_LP_MEM_FORCE_PU_S  1
/** LP_AON_HUK_MEM_FORCE_PD : R/W; bitpos: [2]; default: 1;
 *  force off huk memory
 */
#define LP_AON_HUK_MEM_FORCE_PD    (BIT(2))
#define LP_AON_HUK_MEM_FORCE_PD_M  (LP_AON_HUK_MEM_FORCE_PD_V << LP_AON_HUK_MEM_FORCE_PD_S)
#define LP_AON_HUK_MEM_FORCE_PD_V  0x00000001U
#define LP_AON_HUK_MEM_FORCE_PD_S  2
/** LP_AON_HUK_MEM_FORCE_PU : R/W; bitpos: [3]; default: 0;
 *  force on huk memory
 */
#define LP_AON_HUK_MEM_FORCE_PU    (BIT(3))
#define LP_AON_HUK_MEM_FORCE_PU_M  (LP_AON_HUK_MEM_FORCE_PU_V << LP_AON_HUK_MEM_FORCE_PU_S)
#define LP_AON_HUK_MEM_FORCE_PU_V  0x00000001U
#define LP_AON_HUK_MEM_FORCE_PU_S  3

/** LP_AON_PUF_MEM_SW_REG register
 *  configure the power switch of PUFMEM
 */
#define LP_AON_PUF_MEM_SW_REG (DR_REG_LP_AON_BASE + 0x80)
/** LP_AON_PUF_MEM_SW : R/W; bitpos: [0]; default: 1;
 *  power switch of PD_LPPUFMEM
 */
#define LP_AON_PUF_MEM_SW    (BIT(0))
#define LP_AON_PUF_MEM_SW_M  (LP_AON_PUF_MEM_SW_V << LP_AON_PUF_MEM_SW_S)
#define LP_AON_PUF_MEM_SW_V  0x00000001U
#define LP_AON_PUF_MEM_SW_S  0

/** LP_AON_PUF_MEM_ISO_REG register
 *  configure the iso of PD_PUFMEM
 */
#define LP_AON_PUF_MEM_ISO_REG (DR_REG_LP_AON_BASE + 0x84)
/** LP_AON_PUF_MEM_ISO : R/W; bitpos: [0]; default: 0;
 *  ISO enable of PD_LPPUFMEM to PD_SYS
 */
#define LP_AON_PUF_MEM_ISO    (BIT(0))
#define LP_AON_PUF_MEM_ISO_M  (LP_AON_PUF_MEM_ISO_V << LP_AON_PUF_MEM_ISO_S)
#define LP_AON_PUF_MEM_ISO_V  0x00000001U
#define LP_AON_PUF_MEM_ISO_S  0

/** LP_AON_PUF_MEM_DISCHARGE_REG register
 *  configure the discharge gate of PUFMEM
 */
#define LP_AON_PUF_MEM_DISCHARGE_REG (DR_REG_LP_AON_BASE + 0x88)
/** LP_AON_PUF_MEM_DISCHARGE : R/W; bitpos: [0]; default: 0;
 *  discharge gate of LPPUFMEM
 */
#define LP_AON_PUF_MEM_DISCHARGE    (BIT(0))
#define LP_AON_PUF_MEM_DISCHARGE_M  (LP_AON_PUF_MEM_DISCHARGE_V << LP_AON_PUF_MEM_DISCHARGE_S)
#define LP_AON_PUF_MEM_DISCHARGE_V  0x00000001U
#define LP_AON_PUF_MEM_DISCHARGE_S  0

/** LP_AON_DATE_REG register
 *  reserved
 */
#define LP_AON_DATE_REG (DR_REG_LP_AON_BASE + 0x3fc)
/** LP_AON_DATE : R/W; bitpos: [30:0]; default: 37818656;
 *  version register
 */
#define LP_AON_DATE    0x7FFFFFFFU
#define LP_AON_DATE_M  (LP_AON_DATE_V << LP_AON_DATE_S)
#define LP_AON_DATE_V  0x7FFFFFFFU
#define LP_AON_DATE_S  0
/** LP_AON_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  version register
 */
#define LP_AON_CLK_EN    (BIT(31))
#define LP_AON_CLK_EN_M  (LP_AON_CLK_EN_V << LP_AON_CLK_EN_S)
#define LP_AON_CLK_EN_V  0x00000001U
#define LP_AON_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
